In [40]:
import pandas as pd
import sqlite3

In [39]:
cnn = sqlite3.connect('SQL.db')

In [41]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [42]:
%sql sqlite:///SQL.db

In [43]:
%%sql
CREATE TABLE tblDepartment(
    DepartmentID INT,
    DepartmentName NVARCHAR (25),
    DepartmentHead NVARCHAR (20),
    PRIMARY KEY (DepartmentID)
)

 * sqlite:///SQL.db
(sqlite3.OperationalError) table tblDepartment already exists
[SQL: CREATE TABLE tblDepartment(
    DepartmentID INT,
    DepartmentName NVARCHAR (25),
    DepartmentHead NVARCHAR (20),
    PRIMARY KEY (DepartmentID)
)]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [44]:
%%sql
INSERT INTO tblDepartment VALUES
(1, 'IT', 'Shimi'),
(2, 'HR', 'Roth'),
(3, 'Payroll', 'Itai'),
(4, 'Other Department', 'Simha')

 * sqlite:///SQL.db
(sqlite3.IntegrityError) UNIQUE constraint failed: tblDepartment.DepartmentID
[SQL: INSERT INTO tblDepartment VALUES
(1, 'IT', 'Shimi'),
(2, 'HR', 'Roth'),
(3, 'Payroll', 'Itai'),
(4, 'Other Department', 'Simha')]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [45]:
%%sql
Select *
from tblDepartment

 * sqlite:///SQL.db
Done.

[(1, 'IT', 'Shimi'),
 (2, 'HR', 'Roth'),
 (3, 'Payroll', 'Itai'),
 (4, 'Other Department', 'Simha')]

In [46]:
%%sql
CREATE TABLE tblemployee
(
    employeeID INT,
    firstName NVARCHAR (30),
    lastName NVARCHAR (30),
    gender NVARCHAR (10),
    Email NVARCHAR (50),
    PhoneNumber NVARCHAR (15),
    salary INT,
    city NVARCHAR (20),
    HireDate DATE,
    DepartmentID INT,

    FOREIGN KEY (DepartmentID) REFERENCES tblDepartment (DepartmentID),
    PRIMARY KEY (employeeID)

)

 * sqlite:///SQL.db
(sqlite3.OperationalError) table tblemployee already exists
[SQL: CREATE TABLE tblemployee
(
    employeeID INT,
    firstName NVARCHAR (30),
    lastName NVARCHAR (30),
    gender NVARCHAR (10),
    Email NVARCHAR (50),
    PhoneNumber NVARCHAR (15),
    salary INT,
    city NVARCHAR (20),
    HireDate DATE,
    DepartmentID INT,

    FOREIGN KEY (DepartmentID) REFERENCES tblDepartment (DepartmentID),
    PRIMARY KEY (employeeID)

)]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [47]:
%%sql
INSERT INTO tblemployee VALUES
(1,'Tomer', 'Itzhakov','Male', 'Tomerikoka@gmail.com', '0508554622', 11000, 'Jerusalem', '20011201',1),
(2,'Shira', 'Nevo','Female', 'Shira@gmail.com', '0508515542', 8000, 'Jerusalem', '20020615',4),
(3,'Ester', 'Hyut','Female', 'Ester@gmail.com', '0508575148', 10000, 'Jerusalem', '20120528',3),
(4,'Robin', 'Choen','Male', 'Robin@gmail.com', '0528542523', 7000, 'Tel-Aviv', '20120224',2),
(5,'Shlomi', 'Hai','Male', 'Shlomi@gmail.com', '0528456122', 10000, 'Tel-Aviv', '20081019',3),
(6,'David', 'Kepler','Male', 'David@gmail.com', '0558847365', 11000, 'Tel-Aviv', '20160515',1),
(7,'Dana', 'Tova','Female', 'Dana@gmail.com', '0556789322', 4000, 'Tel-Aviv', '20160202',2),
(8,'Idan', 'Haviv','Male', 'Idan@gmail.com', '0508752256', 10000, 'Haifa', '20170522',3),
(9,'Eti', 'Boblil','Female', 'Eti@gmail.com', '0505847665', 2000, 'Haifa', '20180614',4),
(10,'Esti', 'Karlibah','Female', 'Esti@gmail.com', '0504859998', 1000, 'Haifa', '20140713',2)

 * sqlite:///SQL.db
(sqlite3.IntegrityError) UNIQUE constraint failed: tblemployee.employeeID
[SQL: INSERT INTO tblemployee VALUES
(1,'Tomer', 'Itzhakov','Male', 'Tomerikoka@gmail.com', '0508554622', 11000, 'Jerusalem', '20011201',1),
(2,'Shira', 'Nevo','Female', 'Shira@gmail.com', '0508515542', 8000, 'Jerusalem', '20020615',4),
(3,'Ester', 'Hyut','Female', 'Ester@gmail.com', '0508575148', 10000, 'Jerusalem', '20120528',3),
(4,'Robin', 'Choen','Male', 'Robin@gmail.com', '0528542523', 7000, 'Tel-Aviv', '20120224',2),
(5,'Shlomi', 'Hai','Male', 'Shlomi@gmail.com', '0528456122', 10000, 'Tel-Aviv', '20081019',3),
(6,'David', 'Kepler','Male', 'David@gmail.com', '0558847365', 11000, 'Tel-Aviv', '20160515',1),
(7,'Dana', 'Tova','Female', 'Dana@gmail.com', '0556789322', 4000, 'Tel-Aviv', '20160202',2),
(8,'Idan', 'Haviv','Male', 'Idan@gmail.com', '0508752256', 10000, 'Haifa', '20170522',3),
(9,'Eti', 'Boblil','Female', 'Eti@gmail.com', '0505847665', 2000, 'Haifa', '20180614',4),
(10,'Esti', 'Karlibah','Female', 'Esti@gmail.com', '0504859998', 1000, 'Haifa', '20140713',2)]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

 #### Распечатать всю таблицу tblemployee

In [48]:
%%sql
SELECT * FROM tblemployee

 * sqlite:///SQL.db
Done.

[(1, 'Tomer', 'Itzhakov', 'Male', 'Tomerikoka@gmail.com', '0508554622', 11000, 'Jerusalem', 20011201, 1),
 (2, 'Shira', 'Nevo', 'Female', 'Shira@gmail.com', '0508515542', 8000, 'Jerusalem', 20020615, 4),
 (3, 'Ester', 'Hyut', 'Female', 'Ester@gmail.com', '0508575148', 10000, 'Jerusalem', 20120528, 3),
 (4, 'Robin', 'Choen', 'Male', 'Robin@gmail.com', '0528542523', 7000, 'Tel-Aviv', 20120224, 2),
 (5, 'Shlomi', 'Hai', 'Male', 'Shlomi@gmail.com', '0528456122', 10000, 'Tel-Aviv', 20081019, 3),
 (6, 'David', 'Kepler', 'Male', 'David@gmail.com', '0558847365', 11000, 'Tel-Aviv', 20160515, 1),
 (7, 'Dana', 'Tova', 'Female', 'Dana@gmail.com', '0556789322', 4000, 'Tel-Aviv', 20160202, 2),
 (8, 'Idan', 'Haviv', 'Male', 'Idan@gmail.com', '0508752256', 10000, 'Haifa', 20170522, 3),
 (9, 'Eti', 'Boblil', 'Female', 'Eti@gmail.com', '0505847665', 2000, 'Haifa', 20180614, 4),
 (10, 'Esti', 'Karlibah', 'Female', 'Esti@gmail.com', '0504859998', 1000, 'Haifa', 20140713, 2)]

In [49]:
%%sql
SELECT * FROM tblDepartment

 * sqlite:///SQL.db
Done.

[(1, 'IT', 'Shimi'),
 (2, 'HR', 'Roth'),
 (3, 'Payroll', 'Itai'),
 (4, 'Other Department', 'Simha')]

#### Выбрать всех женщин  из tblemployee. Показывать только имя, пол и номер телефона

#### Выберите всех мужчин, которые живут в Иерусалиме и Хайфе.

in

с помощью логических условий

 * sqlite:///The_SQL_Server_Trail_Database.db
Done.

[(1, 'Tomer', 'Itzhakov', 'Male', 'Tomerikoka@gmail.com', '0508554622', 11000, 'Jerusalem', 20011201, 1),
 (8, 'Idan', 'Haviv', 'Male', 'Idan@gmail.com', '0508752256', 10000, 'Haifa', 20170522, 3)]

#### Выбрать всех сотрудников с зарплатой 6000 или 11000

or

in

 * sqlite:///The_SQL_Server_Trail_Database.db
Done.

[(1, 'Tomer', 'Itzhakov', 'Male', 'Tomerikoka@gmail.com', '0508554622', 11000, 'Jerusalem', 20011201, 1),
 (6, 'David', 'Kepler', 'Male', 'David@gmail.com', '0558847365', 11000, 'Tel-Aviv', 20160515, 1)]

#### Выберите всех сотрудников, которые живут в Иерусалиме и Хайфе с зарплатой от 4000 до 10000

 * sqlite:///The_SQL_Server_Trail_Database.db
Done.

[(2, 'Shira', 'Nevo', 'Female', 'Shira@gmail.com', '0508515542', 8000, 'Jerusalem', 20020615, 4),
 (3, 'Ester', 'Hyut', 'Female', 'Ester@gmail.com', '0508575148', 10000, 'Jerusalem', 20120528, 3),
 (8, 'Idan', 'Haviv', 'Male', 'Idan@gmail.com', '0508752256', 10000, 'Haifa', 20170522, 3)]

#### Выбрать всех сотрудников с номером телефона, начинающимся с 050

#### Выбрать всех сотрудников с номером телефона, не начинающимся с 050

 * sqlite:///The_SQL_Server_Trail_Database.db
Done.

[(4, 'Robin', 'Choen', 'Male', 'Robin@gmail.com', '0528542523', 7000, 'Tel-Aviv', 20120224, 2),
 (5, 'Shlomi', 'Hai', 'Male', 'Shlomi@gmail.com', '0528456122', 10000, 'Tel-Aviv', 20081019, 3),
 (6, 'David', 'Kepler', 'Male', 'David@gmail.com', '0558847365', 11000, 'Tel-Aviv', 20160515, 1),
 (7, 'Dana', 'Tova', 'Female', 'Dana@gmail.com', '0556789322', 4000, 'Tel-Aviv', 20160202, 2)]

#### Выберите 5 строк со столбцами имени, зарплаты и города в порядке зарплаты (от максимальной зарплаты до минимальной зарплаты)

###  Группировка по вопросам - используйте таблицу tblemployee

#### Показать среднюю зарплату по полу

 * sqlite:///The_SQL_Server_Trail_Database.db
Done.

[('Female', 5000.0), ('Male', 9800.0)]

#### Ппоказать среднюю зарплату по городам в порядке средней зарплаты от макс до мин

#### Показать максимальную и минимальную зарплату по полу

#### Показать максимальную и минимальную зарплату по полу и городу

####  Показать сумарная зарплата по полу и городу

#### Подсчитайте общее количество сотрудников-женщин

####  Подсчитайте общее количество сотрудников в Тель-Авиве

 * sqlite:///The_SQL_Server_Trail_Database.db
Done.

[('Tel-Aviv', 4)]

#### Показать сумарную зарплату по городам только для городов с общей зарплатой выше 20000 и отсортировать их от макс до мин.

#### Показать сумарную зарплату только для мужчин, проживающих в Иерусалиме и Тель-Авиве.

## Join

In [50]:
%%sql
CREATE TABLE tblCategory
(
CategoryID INT PRIMARY KEY NOT NULL,
CategoryName NVARCHAR (25)
) ;

INSERT INTO tblCategory VALUES
(1, 'Kitchen'),
(2, 'Living Room'),
(3, 'Bedroom'),
(4, 'Electrical appliance');

 * sqlite:///SQL.db
(sqlite3.OperationalError) table tblCategory already exists
[SQL: CREATE TABLE tblCategory
(
CategoryID INT PRIMARY KEY NOT NULL,
CategoryName NVARCHAR (25)
) ;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [51]:
%%sql
CREATE TABLE tblSubCategory
(
SubCategoryID INT,
SubCategoryName VARCHAR (30) NOT NULL,
CategoryID INT NOT NULL,
FOREIGN KEY (CategoryID) REFERENCES tblCategory (CategoryID),
PRIMARY KEY (SubCategoryID)
) ;

 * sqlite:///SQL.db
(sqlite3.OperationalError) table tblSubCategory already exists
[SQL: CREATE TABLE tblSubCategory
(
SubCategoryID INT,
SubCategoryName VARCHAR (30) NOT NULL,
CategoryID INT NOT NULL,
FOREIGN KEY (CategoryID) REFERENCES tblCategory (CategoryID),
PRIMARY KEY (SubCategoryID)
) ;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [52]:
%%sql
INSERT INTO tblSubCategory VALUES
(1,'Sink',1),
(2,'Tap',1),
(3,'Capboard',1),
(4,'Couch',2),
(5,'Dining table',2),
(6,'Easy Chair',2),
(7,'Bed',3),
(8,'Desk',3),
(9,'Mirror',3),
(10, 'Television',4),
(11, 'Washing Machine',4),
(12,'Electric Heater',4) ;

 * sqlite:///SQL.db
(sqlite3.IntegrityError) UNIQUE constraint failed: tblSubCategory.SubCategoryID
[SQL: INSERT INTO tblSubCategory VALUES
(1,'Sink',1),
(2,'Tap',1),
(3,'Capboard',1),
(4,'Couch',2),
(5,'Dining table',2),
(6,'Easy Chair',2),
(7,'Bed',3),
(8,'Desk',3),
(9,'Mirror',3),
(10, 'Television',4),
(11, 'Washing Machine',4),
(12,'Electric Heater',4) ;]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [53]:
%%sql
CREATE TABLE tblProducts
(
ProductID INTNOT NULL,
ProductName VARCHAR (45),
ProductPrice INT,
SubCategoryID INT,
FOREIGN KEY (SubCategoryID) REFERENCES tblSubCategory (SubCategoryID),
PRIMARY KEY(ProductID)
);

 * sqlite:///SQL.db
(sqlite3.OperationalError) table tblProducts already exists
[SQL: CREATE TABLE tblProducts
(
ProductID INTNOT NULL,
ProductName VARCHAR (45),
ProductPrice INT,
SubCategoryID INT,
FOREIGN KEY (SubCategoryID) REFERENCES tblSubCategory (SubCategoryID),
PRIMARY KEY(ProductID)
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [55]:
%%sql
INSERT INTO tblProducts VALUES
(1,'Big Sink',5000,1),
(2,'Small Sink',3500,1),
(3,'Nirosta Sink',7500,1),
(4,'Big Tap',2000,2),
(5,'Small Tap',1000,2),
(6,'Standard Tap',500,2),
(7,'Big Capboard',4000,3),
(8,'Small Capboard',2500,3),
(9,'IKEA Capboard',2000,3),
(10,'Big Couch',4552,4),
(11,'Small Couch',2500,4),
(12,'Leather Couch',1500,4),
(13,'Round Table',8000,5),
(14, 'Rectangle Table',5000,5),
(15,'IKEA Table',3500,5),
(16,'American comfort',9000,6),
(17,'IKEA Single Chair',3500,6),
(18, 'Beytily Chair',4000,6),
(19,'King size bed',9500,7),
(20,'Queen size bed',11000,7),
(21, 'Single size bed',6000,7),
(22,'IKEA Desk',1500,8),
(23, 'Whole wood Desk',4500,8),
(24, 'Plywood Desk',1000,8),
(25,'Big Mirror',1500,9),
(26,'Small Mirror',500,9),
(27,'Personal Mirror',2500,9),
(28,'56 inch Samsung',5500,10),
(29,'32 inch HP',3500,10),
(30,'21 inch DELL',2700,10),
(31,'Bosh Machine',7000,11),
(32,'Samsung Machine',5000,11),
(33,'Makita Machine',4500,11),
(34,'Big Heater',500,12),
(35,'Small Heater',350,12),
(36,'Rocket Heater',200,12),
(37,'Coffee',5,null),
(38,'brown suger',0.5,null),
(39,'Tea',3,null),
(40, 'biscuit',6,null);

 * sqlite:///SQL.db
(sqlite3.IntegrityError) UNIQUE constraint failed: tblProducts.ProductID
[SQL: INSERT INTO tblProducts VALUES
(1,'Big Sink',5000,1),
(2,'Small Sink',3500,1),
(3,'Nirosta Sink',7500,1),
(4,'Big Tap',2000,2),
(5,'Small Tap',1000,2),
(6,'Standard Tap',500,2),
(7,'Big Capboard',4000,3),
(8,'Small Capboard',2500,3),
(9,'IKEA Capboard',2000,3),
(10,'Big Couch',4552,4),
(11,'Small Couch',2500,4),
(12,'Leather Couch',1500,4),
(13,'Round Table',8000,5),
(14, 'Rectangle Table',5000,5),
(15,'IKEA Table',3500,5),
(16,'American comfort',9000,6),
(17,'IKEA Single Chair',3500,6),
(18, 'Beytily Chair',4000,6),
(19,'King size bed',9500,7),
(20,'Queen size bed',11000,7),
(21, 'Single size bed',6000,7),
(22,'IKEA Desk',1500,8),
(23, 'Whole wood Desk',4500,8),
(24, 'Plywood Desk',1000,8),
(25,'Big Mirror',1500,9),
(26,'Small Mirror',500,9),
(27,'Personal Mirror',2500,9),
(28,'56 inch Samsung',5500,10),
(29,'32 inch HP',3500,10),
(30,'21 inch DELL',2700,10),
(31,'Bosh Machine',7000,11),
(32,'Samsung Machine',5000,11),
(33,'Makita Machine',4500,11),
(34,'Big Heater',500,12),
(35,'Small Heater',350,12),
(36,'Rocket Heater',200,12),
(37,'Coffee',5,null),
(38,'brown suger',0.5,null),
(39,'Tea',3,null),
(40, 'biscuit',6,null);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [56]:
%%sql
SELECT * FROM tblProducts

 * sqlite:///SQL.db
Done.

[(1, 'Big Sink', 5000, 1),
 (2, 'Small Sink', 3500, 1),
 (3, 'Nirosta Sink', 7500, 1),
 (4, 'Big Tap', 2000, 2),
 (5, 'Small Tap', 1000, 2),
 (6, 'Standard Tap', 500, 2),
 (7, 'Big Capboard', 4000, 3),
 (8, 'Small Capboard', 2500, 3),
 (9, 'IKEA Capboard', 2000, 3),
 (10, 'Big Couch', 4552, 4),
 (11, 'Small Couch', 2500, 4),
 (12, 'Leather Couch', 1500, 4),
 (13, 'Round Table', 8000, 5),
 (14, 'Rectangle Table', 5000, 5),
 (15, 'IKEA Table', 3500, 5),
 (16, 'American comfort', 9000, 6),
 (17, 'IKEA Single Chair', 3500, 6),
 (18, 'Beytily Chair', 4000, 6),
 (19, 'King size bed', 9500, 7),
 (20, 'Queen size bed', 11000, 7),
 (21, 'Single size bed', 6000, 7),
 (22, 'IKEA Desk', 1500, 8),
 (23, 'Whole wood Desk', 4500, 8),
 (24, 'Plywood Desk', 1000, 8),
 (25, 'Big Mirror', 1500, 9),
 (26, 'Small Mirror', 500, 9),
 (27, 'Personal Mirror', 2500, 9),
 (28, '56 inch Samsung', 5500, 10),
 (29, '32 inch HP', 3500, 10),
 (30, '21 inch DELL', 2700, 10),
 (31, 'Bosh Machine', 7000, 11),
 (32, 'Samsung Machine', 5000, 11),
 (33, 'Makita Machine', 4500, 11),
 (34, 'Big Heater', 500, 12),
 (35, 'Small Heater', 350, 12),
 (36, 'Rocket Heater', 200, 12),
 (37, 'Coffee', 5, None),
 (38, 'brown suger', 0.5, None),
 (39, 'Tea', 3, None),
 (40, 'biscuit', 6, None)]

In [57]:
%%sql
SELECT * FROM tblSubCategory

 * sqlite:///SQL.db
Done.

[(1, 'Sink', 1),
 (2, 'Tap', 1),
 (3, 'Capboard', 1),
 (4, 'Couch', 2),
 (5, 'Dining table', 2),
 (6, 'Easy Chair', 2),
 (7, 'Bed', 3),
 (8, 'Desk', 3),
 (9, 'Mirror', 3),
 (10, 'Television', 4),
 (11, 'Washing Machine', 4),
 (12, 'Electric Heater', 4)]

In [58]:
%%sql
SELECT * FROM tblCategory

 * sqlite:///SQL.db
Done.

[(1, 'Kitchen'),
 (2, 'Living Room'),
 (3, 'Bedroom'),
 (4, 'Electrical appliance')]

#### Создайте внутреннее соединение между tblproducts и tblsubcategory. ( Из tblproducts показать productName и productPrice. Из tblsubcategory показать имя_подкатегории.)

#### Создайте внутреннее соединение между tblproducts и tblcategory.<br>
-- из tblproducts показать productName и productPrice.<br>
-- из tblcategory показать имя_категории.

#### ЛЕВОЕ соединение между tblproducts и tblcategory.<br>
- из tblproducts показать productName и productPrice.
- из tblcategory показать имя_категории.

#### Показать сумарную цену продукта по названию категории в порядке от макс до мин.

In [ ]:
%%sql
SELECT      CT.CategoryName, SUM(PR.ProductPrice) AS [Total Price]
FROM        tblProducts AS PR
Left JOIN  tblSubCategory AS SC
ON          PR.SubCategoryID = SC.SubCategoryID
Left JOIN  tblCategory AS CT
ON          SC.CategoryID = CT.CategoryID
GROUP BY    CT.CategoryName
ORDER BY    SUM(PR.ProductPrice) DESC

UsageError: Cell magic `%%sql` not found.

-Вопрос 7 - показать название самого дорогого товара с подкатегорией и категорией.

-- -Вопрос 8 - показать название самого дорогого продукта в категории name = 'kitchen'.
-- если у вас есть нулевые значения, не показывайте их!

-- Тема 06 - Математические функции -- используйте таблицу tblGenderMeasurements.
-- Вопрос 1. Создайте AVG для каждого из параметров: Возраст, Рост и Вес по полу. точно, увеличьте число AVG для каждого из параметров.
-- Ответ:

-- Вопрос 2. Создайте тот же запрос, но теперь укажите числа AVG.
-- Ответ:


-- Вопрос 3. Создайте тот же запрос, но теперь округляйте числа AVG.
-- Ответ:

In [59]:
%%sql
CREATE TABLE tblGenderMeasurements
(
NumerID INT ,
Name    NVARCHAR (30),
Gender  NVARCHAR (20),
Age     DECIMAL (8,2),
Height  DECIMAL (8,2),
Weight  DECIMAL (8,2),
PRIMARY KEY(NumerID)
)

 * sqlite:///SQL.db
(sqlite3.OperationalError) table tblGenderMeasurements already exists
[SQL: CREATE TABLE tblGenderMeasurements
(
NumerID INT ,
Name    NVARCHAR (30),
Gender  NVARCHAR (20),
Age     DECIMAL (8,2),
Height  DECIMAL (8,2),
Weight  DECIMAL (8,2),
PRIMARY KEY(NumerID)
)]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [60]:
%%sql
INSERT INTO tblGenderMeasurements VALUES
(1,'Tomer','Male',31.4,1.73,68.5),
(2,'Shai','Male',28.5,1.81,73.8),
(3,'Noam','Male',32.3,1.77,80.8),
(4,'Ben','Male',27.7,1.86,105.9),
(5,'Rita','Female',32.2,1.65,61.8),
(6,'Simha','Female',29.5,1.73,55.6),
(7,'Efrat','Female',35.2,1.70,59.4),
(8,'Miri','Female',26.4,1.78,63.8)

 * sqlite:///SQL.db
(sqlite3.IntegrityError) UNIQUE constraint failed: tblGenderMeasurements.NumerID
[SQL: INSERT INTO tblGenderMeasurements VALUES
(1,'Tomer','Male',31.4,1.73,68.5),
(2,'Shai','Male',28.5,1.81,73.8),
(3,'Noam','Male',32.3,1.77,80.8),
(4,'Ben','Male',27.7,1.86,105.9),
(5,'Rita','Female',32.2,1.65,61.8),
(6,'Simha','Female',29.5,1.73,55.6),
(7,'Efrat','Female',35.2,1.70,59.4),
(8,'Miri','Female',26.4,1.78,63.8)]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

-- Вопрос 1. Создайте AVG для каждого из параметров: Возраст, Рост и Вес по полу. точно, увеличьте число AVG для каждого из параметров.
-- Ответ:

-- Вопрос 2. Создайте тот же запрос, но теперь укажите числа AVG.
-- Ответ:


-- Вопрос 3. Создайте тот же запрос, но теперь округляйте числа AVG.
-- Ответ:

 * sqlite:///SQL_Server_Trail.db
Done.

[(30.8, 1.7, 60.2), (30.0, 1.8, 82.3)]

Показать текущую дату

In [61]:
%%sql
SELECT strftime('%Y %m %d','now');

 * sqlite:///SQL.db
Done.

[('2025 07 08',)]

Показать текущую дату и время

In [62]:
%%sql
select datetime('now','localtime')

 * sqlite:///SQL.db
Done.

[('2025-07-08 07:39:03',)]